using Tyuiu.KolganenkoRV.Sprint2.Task6.V5.Lib;

DataService ds = new DataService();

Console.Title = "Спринт #2 | Выполнила : Колганенко Р. В. | ИБКСб-25-1";
//Длина строки 75 символов
Console.WriteLine("***************************************************************************");
Console.WriteLine("* Спринт #2                                                               *");
Console.WriteLine("* Тема: Базовые навыки работы в C#                                        *");
Console.WriteLine("* Задание #6                                                              *");
Console.WriteLine("* Вариант #5                                                              *");
Console.WriteLine("* Выполнил: Колганенко Ринат Витальевич | ИБКСб-25-1                      *"); //Написать программу, которая использует сокращенную форму записи оператора switch вычисляет требуемое значение и возвращает результат.
Console.WriteLine("***************************************************************************");
Console.WriteLine("* УСЛОВИЕ:                                                                *");
Console.WriteLine("* Написать программу, которая использует сокращенную форму оператора      *");
Console.WriteLine("* switch вычисляет требуемое значение и возвращает результат.             *");
Console.WriteLine("***************************************************************************");
Console.WriteLine("* ИСХОДНЫЕ ДАННЫЕ:                                                        *");
Console.WriteLine("***************************************************************************");

Console.WriteLine("Введите величину своей карты:");
int value = Convert.ToInt32(Console.ReadLine());

string res;

if ((value > 14) || (value < 6))
{
    res = ("Выберите больше 5, в садике не учили первые 5 цифр?" );
}
else
{
    res = ("Это " + ds.FindCardValue(value));
}
Console.WriteLine("***************************************************************************");
Console.WriteLine("* РЕЗУЛЬТАТ:                                                              *");
Console.WriteLine("***************************************************************************");

Console.WriteLine(res);

Console.ReadLine();